### Aggregation / grouping:

In [ ]:
# reading file if instead comma separated, (;) separated
#pd.read_csv('filename.csv', sep= ';')

In [4]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({ 'Sex': ['M','F','M','M','M','F'],
                    'Age':[22,33,32,24,22,33],
                  },index=['abhijeet','shalini','daya','anil','ravi','swati'])

In [3]:
df

         Sex  Age
abhijeet   M   22
shalini    F   33
daya       M   32
anil       M   24
ravi       M   22
swati      F   33

In [9]:
df[0:2]['Sex']

abhijeet    M
shalini     F
Name: Sex, dtype: object

In [4]:
df.groupby('Sex')

In [5]:
df.groupby('Sex').mean()

      Age
Sex
F    33.0
M    25.0

In [5]:
df['Sex'].count()

6

In [31]:
df.groupby('Sex')['Age'].mean()

Sex
F    33
M    25
Name: Age, dtype: int64

In [6]:
df.groupby('Sex')[['Age']].mean()

      Age
Sex
F    33.0
M    25.0

### Groupby method makes a categor. Colm. index nd finds every operation on numer.colm w.r.t groupbycolm.

In [6]:
df = pd.DataFrame({ 'Sex': ['M','F','M','M','M','F'],
                   'Region':['North','North','South','South','East','South'],
                    'Age':[22,33,32,24,22,33],
                    'Height':[122,133,132,124,122,133],
                    'Weight':[60,55,70,71,57,68],
                    'location':['ind','ujj','mumb','kash','pune','nasik']
                  },index=['abhijeet','shalini','daya','anil','ravi','swati'])

In [13]:
df.groupby('Region')['Sex'].value_counts()

Region  Sex
East    M      1
North   F      1
        M      1
South   M      2
        F      1
Name: Sex, dtype: int64

In [11]:
a['Sex'].value_counts()

Region  Sex
East    M      1
North   F      1
        M      1
South   M      2
        F      1
Name: Sex, dtype: int64

In [10]:
df.groupby('Sex').mean()      # mean can b found usin direct df[].mean but only one colm possible
#df['Age']

      Age  Height  Weight
Sex
F    33.0   133.0    61.5
M    25.0   125.0    64.5

In [30]:
df.groupby('Sex')[['Age','Height']].mean()       # mean of particular num. feature

     Age  Height
Sex
F     33     133
M     25     125

In [19]:
type(v2)

pandas.core.frame.DataFrame

In [20]:
v2.shape

(2, 2)

### defining Groupby Obj.

In [11]:
ob1 = df.groupby('Sex')

In [12]:
ob1.size()

Sex
F    2
M    4
dtype: int64

### ob.get_group()   callin groupby attrib.(M,F)

In [13]:
ob1.get_group('M')

         Sex Region  Age  Height  Weight location
abhijeet   M  North   22     122      60      ind
daya       M  South   32     132      70     mumb
anil       M  South   24     124      71     kash
ravi       M   East   22     122      57     pune

In [14]:
ob1.get_group('F')

        Sex Region  Age  Height  Weight location
shalini   F  North   33     133      55      ujj
swati     F  South   33     133      68    nasik

In [15]:
ob1['Weight'].mean()    # accessing mean of obj.

Sex
F    61.5
M    64.5
Name: Weight, dtype: float64

In [15]:
ob2 = df.groupby('Region')
ob2

In [14]:
ob2.get_group('South')

      Sex Region  Age  Height  Weight location
daya    M  South   32     132      70     mumb
anil    M  South   24     124      71     kash
swati   F  South   33     133      68    nasik

In [45]:
ob2.mean()

              Age      Height     Weight
Region
East    22.000000  122.000000  57.000000
North   27.500000  127.500000  57.500000
South   29.666667  129.666667  69.666667

In [18]:
ob2['Age'].mean()   # method 1 accesing other colm mean value (by obj.[colm.].mean())

Region
East     22.000000
North    27.500000
South    29.666667
Name: Age, dtype: float64

In [9]:
df.groupby('Sex')['Height'].mean()      # method 2 . df.groupby(attr)[colm.].mean()

Sex
F    133.0
M    125.0
Name: Height, dtype: float64

In [48]:
df

         Sex Region  Age  Height  Weight location
abhijeet   M  North   22     122      60      ind
shalini    F  North   33     133      55      ujj
daya       M  South   32     132      70     mumb
anil       M  South   24     124      71     kash
ravi       M   East   22     122      57     pune
swati      F  South   33     133      68    nasik

### Groupby two attributs

In [19]:
df.groupby(['Sex','Region']).mean()

             Age  Height  Weight
Sex Region
F   North   33.0   133.0    55.0
    South   33.0   133.0    68.0
M   East    22.0   122.0    57.0
    North   22.0   122.0    60.0
    South   28.0   128.0    70.5

In [56]:
df.groupby(['Region','Sex']).mean()

             Age  Height  Weight
Region Sex
East   M    22.0   122.0    57.0
North  F    33.0   133.0    55.0
       M    22.0   122.0    60.0
South  F    33.0   133.0    68.0
       M    28.0   128.0    70.5

In [55]:
df.groupby(['Region','Sex'])[['Age']].mean()

            Age
Region Sex
East   M     22
North  F     33
       M     22
South  F     33
       M     28

In [69]:
df

         Sex Region  Age  Height  Weight location
abhijeet   M  North   22     122      60      ind
shalini    F  North   33     133      55      ujj
daya       M  South   32     132      70     mumb
anil       M  South   24     124      71     kash
ravi       M   East   22     122      57     pune
swati      F  South   33     133      68    nasik

In [78]:
df['Age'].describe()

count     6.000000
mean     27.666667
std       5.537749
min      22.000000
25%      22.500000
50%      28.000000
75%      32.750000
max      33.000000
Name: Age, dtype: float64

In [79]:
df.groupby('Sex')['Age'].describe()

     count  mean       std   min   25%   50%   75%   max
Sex
F      2.0  33.0  0.000000  33.0  33.0  33.0  33.0  33.0
M      4.0  25.0  4.760952  22.0  22.0  23.0  26.0  32.0

In [4]:
pd.options.display.max_columns

20

In [5]:
pd.options.display.max_columns=50

In [6]:
df.groupby('Sex').describe()

      Age                                               Height         \
    count  mean       std   min   25%   50%   75%   max  count   mean
Sex
F     2.0  33.0  0.000000  33.0  33.0  33.0  33.0  33.0    2.0  133.0
M     4.0  25.0  4.760952  22.0  22.0  23.0  26.0  32.0    4.0  125.0

                                                 Weight                        \
          std    min    25%    50%    75%    max  count  mean       std   min
Sex
F    0.000000  133.0  133.0  133.0  133.0  133.0    2.0  61.5  9.192388  55.0
M    4.760952  122.0  122.0  123.0  126.0  132.0    4.0  64.5  7.047458  57.0


       25%   50%    75%   max
Sex
F    58.25  61.5  64.75  68.0
M    59.25  65.0  70.25  71.0

In [4]:
#df.groupby('Sex').describe().unstack()

#### Aggregate fn. are (mean(), count(), etc applied to a group by colm . we can user defined aggregate fn.also

In [3]:
df= pd.read_csv('C:/Users/hp/Downloads/spaceship_titanic_train.csv')
df.head(3)

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True
2,0003_01,Europa,False,A/0/S,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,Altark Susent,False

In [4]:
#df.agg(['mean'])

In [6]:
df.agg({'Age': ['mean', 'median'], 'RoomService': ['sum','mean']})

             Age   RoomService
mean    28.82793  2.246876e+02
median  27.00000           NaN
sum          NaN  1.912541e+06

In [5]:
def max_tomin(value):
    return max(value) - min(value)

In [12]:
df_grup= df.groupby('HomePlanet')

In [13]:
df_grup.describe()

               Age                                                     \
             count       mean        std  min   25%   50%   75%   max
HomePlanet
Earth       4514.0  26.068232  14.317496  0.0  18.0  23.0  35.0  79.0
Europa      2085.0  34.419664  13.089347  0.0  26.0  33.0  43.0  79.0
Mars        1716.0  29.297203  14.558386  0.0  20.0  28.0  38.0  76.0

           RoomService              ...    Spa           VRDeck              \
                 count        mean  ...    75%      max   count        mean
HomePlanet                          ...
Earth           4499.0  136.940209  ...   35.0   5577.0  4491.0  138.132933
Europa          2095.0  145.231981  ...  579.5  22408.0  2094.0  875.765998
Mars            1723.0  552.897272  ...    3.0   6011.0  1720.0   47.440698


                    std  min  25%  50%    75%      max
HomePlanet
Earth        368.555252  0.0  0.0  0.0   36.5   5321.0
Europa      2119.105572  0.0  0.0  0.0  620.5  24133.0
Mars         209.396768  0.0  0.0  0.0    0.0   2336.0

[3 rows x 48 columns]

In [16]:
# Using AGGREGATE fn. is we apply (agg.fns/user defined fn.) in groupby df 
df_grup.agg(max_tomin)

C:\Users\hp\anaconda3\lib\site-packages\pandas\core\groupby\generic.py:303: FutureWarning: Dropping invalid columns in SeriesGroupBy.agg is deprecated. In a future version, a TypeError will be raised. Before calling .agg, select only columns which should be valid for the aggregating function.
  results[key] = self.aggregate(func)

,CryoSleep,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Transported
HomePlanet,,,,,,,,,
Earth,1,79.0,0,6256.0,5412.0,4581.0,5577.0,5321.0,1
Europa,1,79.0,1,14327.0,29813.0,23492.0,22408.0,24133.0,1
Mars,1,76.0,1,9920.0,6153.0,7810.0,6011.0,2336.0,1

In [1]:
import pandas as pd

In [2]:
import numpy as np

## file readin error

In [ ]:
# SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 0-5: truncated \UXXXXXXXX escape

#Solution 1: Add a “r” character in the beginning of string.:- (title = r'\uFFEF')

#Solution 2: Change \ to be /.
#pd.read_csv("C:\Users\Clay\Desktop\test.txt")
# open("C:/Users/Clay/Desktop/test.txt")      in my system "/" works

Solution 3: Change \ to be \\.
open("C:\Users\Clay\Desktop\test.txt")

or
# open("C:\\Users\\Clay\\Desktop\\test.txt")  nd "\\" works

from sklearn import datasets
# print(datasets.load_wine().DESCR)
df= pd.DataFrame(datasets.load_wine().data)
df.columns= datasets.load_wine().feature_names
df.head()

#### Task:

In [3]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [4]:
df = pd.DataFrame(raw_data)
df.head()

     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62
4    Dragoons     1st     Cooze             3             70

In [15]:
ob=df.groupby('regiment')

In [16]:
ob.get_group('Nighthawks')[['preTestScore']].mean()

preTestScore    15.25
dtype: float64

#### What is the mean preTestScore from the regiment Nighthawks?

In [24]:
ob =df.groupby('regiment')

In [18]:
ob.get_group('Nighthawks')[['preTestScore']].mean()

preTestScore    15.25
dtype: float64

In [17]:
df.describe()

       preTestScore  postTestScore
count     12.000000      12.000000
mean      11.083333      62.333333
std       12.324833      21.376850
min        2.000000      25.000000
25%        2.750000      57.000000
50%        3.500000      62.000000
75%       24.000000      70.000000
max       31.000000      94.000000

In [19]:
df.groupby('company').describe()

        preTestScore                                                      \
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

        postTestScore
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

#### Present general statistics by company

In [28]:
df.groupby('company').describe()

        preTestScore                                                      \
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

        postTestScore
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

In [26]:
df.groupby('company')['preTestScore'].mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

#### What is the mean of each company's preTestScore?

In [24]:
df.groupby('company')['preTestScore'].mean()

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

#### Present the mean preTestScores grouped by regiment and company

In [ ]:
ob2['']

In [26]:
df.groupby(['regiment','company'])[['preTestScore']].mean()

                    preTestScore
regiment   company
Dragoons   1st               3.5
           2nd              27.5
Nighthawks 1st              14.0
           2nd              16.5
Scouts     1st               2.5
           2nd               2.5

#### Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [27]:
df.groupby(['regiment','company'])[['preTestScore']].mean().unstack()

           preTestScore
company             1st   2nd
regiment
Dragoons            3.5  27.5
Nighthawks         14.0  16.5
Scouts              2.5   2.5

In [6]:
import seaborn as sns
import matplotlib.pyplot as plt

In [7]:
sns.barplot(data=df,x=('company','regiment'),y=('Nighthawks'),unstack=True)

ValueError: Could not interpret input 'Nighthawks'

#### What is the number of observations in each regiment and company

In [29]:
df.groupby(['regiment','company']).size()

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

In [32]:
df = pd.DataFrame({ 'Sex': ['M','F','M','M','M','F'],
                   'Region':['North','North','South','South','East','South'],
                    'Age':[22,33,32,24,22,33],
                    'Height':[122,133,132,124,122,133],
                    'Weight':[60,55,70,71,57,68],
                    'location':['ind','ujj','mumb','kash','pune','nasik']
                  },index=['abhijeet','shalini','daya','anil','ravi','swati'])

In [33]:
df.pivot_table(index='Sex')

     Age  Height  Weight
Sex
F     33     133    61.5
M     25     125    64.5

In [34]:
df.groupby('Sex').mean()

      Age  Height  Weight
Sex
F    33.0   133.0    61.5
M    25.0   125.0    64.5

In [35]:
df.pivot_table(index='Sex',aggfunc='sum')

     Age  Height  Weight
Sex
F     66     266     123
M    100     500     258

In [36]:
df.pivot_table('Age',index='Sex')

     Age
Sex
F     33
M     25

In [37]:
df.groupby('Sex')[['Age']].mean()

     Age
Sex
F     33
M     25

In [39]:
df.pivot_table('Age',index='Sex',columns='Region')

Region  East  North  South
Sex
F        NaN   33.0   33.0
M       22.0   22.0   28.0

In [41]:
df.pivot_table('Age',index='Sex',columns='Region')

Region  East  North  South
Sex
F        NaN   33.0   33.0
M       22.0   22.0   56.0

### Datetime in pandas

In [3]:
import pandas as pd
from datetime import datetime
#datetime(year, month, day[, hour[, minute[, second[, microsecond[,tzinfo]]]]])

In [5]:
myyear= 2016
mymonth= 2
myday=3
myhour=2
mymin=8
mysec=7

In [6]:
mydate= datetime(myyear,mymonth,myday)
mydate

datetime.datetime(2016, 2, 3, 0, 0)

In [8]:
mydatetime=datetime(myyear,mymonth,myday,myhour,mymin,mysec)
mydatetime

datetime.datetime(2016, 2, 3, 2, 8, 7)

In [10]:
# Extracting hour out of datetime
#mydatetime.hour
mydatetime.day
#mydatetime.year
#mydatetime.weekday()   # returns day of week Monday == 0 ... Sunday == 6

3

In [11]:
myser= pd.Series(['Nov 3,1997','2000-01-01',None])

In [13]:
myser

0    Nov 3,1997
1    2000-01-01
2          None
dtype: object

In [45]:
myser[0].year

AttributeError: 'str' object has no attribute 'year'

In [15]:
# pd.to_datetime() method
timeser=pd.to_datetime(myser)

In [16]:
timeser[0].year

1997

In [32]:
# American datetime: month-date-year 
# European datformt: date-month-year
# to_datetime : year-month-date

In [20]:
eg_date1= 21-12-2000
eg_date2= 10-12-2000

In [5]:
pd.to_datetime(eg_date1)

Timestamp('1969-12-31 23:59:59.999998009')

In [21]:
a=pd.to_datetime(eg_date2)

In [18]:
eg_te2= 12-10-1940

In [7]:
a.day

31

In [22]:
# style date
style_date= '12--Dec--2012'

In [23]:
pd.to_datetime(style_date,format='%d--%b--%Y')

Timestamp('2012-12-12 00:00:00')

In [24]:
u='13th of Dec 2000'

In [25]:
a=pd.to_datetime(u)
print(a)

2000-12-13 00:00:00

In [26]:
a.date()

datetime.date(2000, 12, 13)

### Load the Data:

In [27]:
df=pd.read_csv('dirtydata.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  32 non-null     int64
 1   Date      31 non-null     object
 2   Pulse     32 non-null     int64
 3   Maxpulse  32 non-null     int64
 4   Calories  30 non-null     float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.4+ KB

In [28]:
df['Date'].head()

0    '2020/12/01'
1    '2020/12/02'
2    '2020/12/03'
3    '2020/12/04'
4    '2020/12/05'
Name: Date, dtype: object

In [36]:
df['Date']= pd.to_datetime(df.Date)

In [37]:
df.Date.head()

0   2020-12-01
1   2020-12-02
2   2020-12-03
3   2020-12-04
4   2020-12-05
Name: Date, dtype: datetime64[ns]

#### accessing datetime : year, months, weekday...

In [43]:
df['Date'].dt.weekday.head()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: Date, dtype: float64

In [35]:
df=pd.read_csv('dirtydata.csv',parse_dates=[1]) 
df.Date.head()

0   2020-12-01
1   2020-12-02
2   2020-12-03
3   2020-12-04
4   2020-12-05
Name: Date, dtype: datetime64[ns]

In [21]:
df=pd.read_csv('dirtydata.csv',index_col='Date') 
df=pd.read_csv('dirtydata.csv',names= ('a','b','c','d','e'))
df=pd.read_csv('dirtydata.csv',skiprows=[2,4,6])
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/03'    103       135     340.0
2        45  '2020/12/05'    117       148     406.0
3        60  '2020/12/07'    110       136     374.0
4       450  '2020/12/08'    104       134     253.3

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  32 non-null     int64
 1   Date      31 non-null     object
 2   Pulse     32 non-null     int64
 3   Maxpulse  32 non-null     int64
 4   Calories  30 non-null     float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.4+ KB

In [14]:
df.describe()

         Duration       Pulse    Maxpulse    Calories
count   32.000000   32.000000   32.000000   30.000000
mean    68.437500  103.500000  128.500000  304.680000
std     70.039591    7.832933   12.998759   66.003779
min     30.000000   90.000000  101.000000  195.100000
25%     60.000000  100.000000  120.000000  250.700000
50%     60.000000  102.500000  127.500000  291.200000
75%     60.000000  106.500000  132.250000  343.975000
max    450.000000  130.000000  175.000000  479.000000

In [53]:
df = pd.read_csv('data/ex2.csv',header=None,names=['a','b','c','d','message'])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [55]:
df = pd.read_csv('data/ex2.csv',header=None,names=['a','b','c','d','message'],index_col='message')
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [58]:
pd.read_table('data/ex3.txt',sep='\s+')

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [59]:
pd.read_csv('data/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [62]:
pd.read_csv('data/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [63]:
pd.read_json('data/ex5.json')

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

***

In [5]:
import pandas as pd

In [ ]:
pd.read_excel()

In [8]:
df = pd.DataFrame({ 'Sex': ['M','F','M','M','M','F'],
                   'Region':['North','North','South','South','East','South'],
                    'Age':[22,33,32,24,22,33],
                    'Height':[122,133,132,124,122,133],
                    'Weight':[60,55,70,71,57,68],
                    'location':['ind','ujj','mumb','kash','pune','nasik']
                  },index=['abhijeet','shalini','daya','anil','ravi','swati'])

In [9]:
df.to_csv('1stfile')

In [10]:
pd.read_csv('1stfile')

  Unnamed: 0 Sex Region  Age  Height  Weight location
0   abhijeet   M  North   22     122      60      ind
1    shalini   F  North   33     133      55      ujj
2       daya   M  South   32     132      70     mumb
3       anil   M  South   24     124      71     kash
4       ravi   M   East   22     122      57     pune
5      swati   F  South   33     133      68    nasik

In [9]:
df.to_csv('1stfile.tsv',sep='\t')

In [10]:
pd.read_csv('1stfile.tsv',sep='\t')

    Unnamed: 0  Duration          Date  Pulse  Maxpulse  Calories
0            0        60  '2020/12/01'    110       130     409.1
1            1        60  '2020/12/02'    117       145     479.0
2            2        60  '2020/12/03'    103       135     340.0
3            3        45  '2020/12/04'    109       175     282.4
4            4        45  '2020/12/05'    117       148     406.0
5            5        60  '2020/12/06'    102       127     300.0
6            6        60  '2020/12/07'    110       136     374.0
7            7       450  '2020/12/08'    104       134     253.3
8            8        30  '2020/12/09'    109       133     195.1
9            9        60  '2020/12/10'     98       124     269.0
10          10        60  '2020/12/11'    103       147     329.3
11          11        60  '2020/12/12'    100       120     250.7
12          12        60  '2020/12/12'    100       120     250.7
13          13        60  '2020/12/13'    106       128     345.3
14          14        60  '2020/12/14'    104       132     379.3
15          15        60  '2020/12/15'     98       123     275.0
16          16        60  '2020/12/16'     98       120     215.2
17          17        60  '2020/12/17'    100       120     300.0
18          18        45  '2020/12/18'     90       112       NaN
19          19        60  '2020/12/19'    103       123     323.0
20          20        45  '2020/12/20'     97       125     243.0
21          21        60  '2020/12/21'    108       131     364.2
22          22        45           NaN    100       119     282.0
23          23        60  '2020/12/23'    130       101     300.0
24          24        45  '2020/12/24'    105       132     246.0
25          25        60  '2020/12/25'    102       126     334.5
26          26        60      20201226    100       120     250.0
27          27        60  '2020/12/27'     92       118     241.0
28          28        60  '2020/12/28'    103       132       NaN
29          29        60  '2020/12/29'    100       132     280.0
30          30        60  '2020/12/30'    102       129     380.3
31          31        60  '2020/12/31'     92       115     243.0

In [8]:
df=pd.read_csv('dirtydata.csv')

In [26]:
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [55]:
df.shape

(32, 5)

In [56]:
df.isna().any()

Duration    False
Date         True
Pulse       False
Maxpulse    False
Calories     True
dtype: bool

In [57]:
df.isna().sum()

Duration    0
Date        1
Pulse       0
Maxpulse    0
Calories    2
dtype: int64

In [27]:
df[df['Calories'].isna()]

    Duration          Date  Pulse  Maxpulse  Calories
18        45  '2020/12/18'     90       112       NaN
28        60  '2020/12/28'    103       132       NaN

In [59]:
df[df['Date'].isna()]

    Duration Date  Pulse  Maxpulse  Calories
22        45  NaN    100       119     282.0

In [60]:
df2=df.dropna()                                ##Deletion: to eliminate vacant rows

In [31]:
df['Calories'].fillna(df.Calories.mean(),inplace=True)

In [62]:
df.Calories.mean()

304.68

In [64]:
df=pd.to_datetime(df['Date'])

In [32]:
df['Date']=df['Date'].fillna('2020/12/01')

In [2]:
import pandas as pd

In [6]:
mydf=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|')

In [8]:
mydf

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [84]:
mydf.nunique()

user_id       943
age            61
gender          2
occupation     21
zip_code      795
dtype: int64

In [ ]:
pd.options